app/services/location_coord_finder.rb

    def self.find_or_fetch(location)

        coord = LocationCoord.find_by(name: location)
        return coord if coord.present?
---
SELECT "location_coords".* FROM "location_coords" WHERE "location_coords"."name" = 'Porto' LIMIT 1
SELECT "location_coords".* FROM "location_coords" WHERE "location_coords"."name" = 'Porto'

    def self.translate_location_to_coords(location)
        gateway = GeoApiService.new(location)
        response = gateway.get_coords

        if response[:success]
            LocationCoord.create(
                name: location,
                lat: response[:data]["results"][0]["lat"],
                lng: response[:data]["results"][0]["lon"],
            )
---
INSERT INTO "location_coords" ("name", "lat", "lng", "created_at", "updated_at") VALUES ('Porto', 41.1494512, -8.6107884, '2025-03-01 15:33:33.758463', '2025-03-01 15:33:33.758463') RETURNING "id"