app/services/sun_time_finder.rb

SELECT "sun_times".* FROM "sun_times" WHERE "sun_times"."lat" = 41.149451 AND "sun_times"."lng" = -8.610788 AND "sun_times"."date" BETWEEN '2025-02-27' AND '2025-03-05'
---
    def self.find_or_fetch(coord,date_start,date_end)
        sun_time = SunTime.where(lat: coord[:lat], lng: coord[:lng], date: Date.parse(date_start)..Date.parse(date_end))
        nDays = (Date.parse(date_end) - Date.parse(date_start)).to_i + 1
        if sun_time.present? && sun_time.any?
            if sun_time.size < nDays

SELECT "sun_times".* FROM "sun_times" WHERE "sun_times"."lat" = 40.3792 AND "sun_times"."lng" = -8.451773 AND "sun_times"."date" BETWEEN '2025-03-01' AND '2025-03-05'
INSERT INTO "sun_times" ("sunrise_time", "sunset_time", "golden_hour", "date", "created_at", "updated_at", "timezone", "lat", "lng") VALUES (NULL, NULL, NULL, '2025-02-27', '2025-03-01 16:01:45.173655', '2025-03-01 16:01:45.173655', NULL, 41.149451, -8.610788) RETURNING "id"
SELECT 1 AS one FROM "sun_times" WHERE "sun_times"."date" = '2025-02-27' AND "sun_times"."lat" = 41.149451 AND "sun_times"."lng" = -8.610788 LIMIT 1
---
    def self.fetch_from_api(coord, date_start,date_end, available_dates)
        gateway = SunsetApiService.new(coord[:lat], coord[:lng], date_start, date_end)
        response = gateway.get_sun_data
        response[:data]["results"].each do |item|
            if !(available_dates.include?(Date.parse(item["date"])))
                SunTime.create(
                    lat: coord[:lat],
                    lng: coord[:lng],
                    sunrise_time: item["sunrise"].present? ? Time.parse(item["sunrise"]).strftime("%H:%M:%S") : nil,
                    sunset_time: item["sunset"].present? ? Time.parse(item["sunset"]).strftime("%H:%M:%S") : nil,
                    golden_hour: item["golden_hour"].present? ? Time.parse(item["golden_hour"]).strftime("%H:%M:%S") : nil,
                    timezone: item["timezone"],
                    date: item["date"],
                )